In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("veiculos.csv")
df

,Year,Make,Model,Description,Price
0,1997,Ford,E350,"ac, abs, moon",3000.0
1,1999,Chevy,"Venture ""Extended Edition""",NaN,4900.0
2,1999,Chevy,"Venture ""Extended Edition, Very Large""",NaN,5000.0
3,1996,Jeep,Grand Cherokee,"MUST SELL!\nair, moon roof, loaded",4799.0

In [5]:
type(df)

pandas.core.frame.DataFrame

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Year         4 non-null      int64
 1   Make         4 non-null      object
 2   Model        4 non-null      object
 3   Description  2 non-null      object
 4   Price        4 non-null      float64
dtypes: float64(1), int64(1), object(3)
memory usage: 292.0+ bytes

In [7]:
df.shape

(4, 5)

In [8]:
type(df.shape)

tuple

In [9]:
df.to_csv("veiculos-salvo.csv", index=False)

In [11]:
df.to_excel("veiculos-salvo.xlsx", index=False)

In [13]:
df_veiculos = pd.read_excel("veiculos-salvo.xlsx")
df_veiculos

,Year,Make,Model,Description,Price
0,1997,Ford,E350,"ac, abs, moon",3000
1,1999,Chevy,"Venture ""Extended Edition""",NaN,4900
2,1999,Chevy,"Venture ""Extended Edition, Very Large""",NaN,5000
3,1996,Jeep,Grand Cherokee,"MUST SELL!\nair, moon roof, loaded",4799

In [15]:
df_iris = pd.read_csv("iris.csv", sep="\t")
df_iris

   Sepal length  Sepal width  Petal length  Petal width    Species
0           5.1          3.5           1.4          0.2  I. setosa
1           4.9          3.0           1.4          0.2  I. setosa
2           4.7          3.2           1.3          0.2  I. setosa
3           4.6          3.1           1.5          0.2  I. setosa
4           5.0          3.6           1.4          0.2  I. setosa

In [ ]:
df_iris = pd.read_excel("iris.csv", sep="\t")
df_iris

In [17]:
df_iris.to_csv("iris2.csv", index=False, sep=";")